* Noting that a page size is always a power of 2, and that the size of memory will always be cleanly divisible by the page size, can you think of a performance optimization we could employ? You are welcome to change the function signature and test runner code.

=shr= with =%rcx=, but by how much? Idea: get the power by which we've raised the page size by 2. Which is poorly worded. If the page size can be expressed by 2 ^ n, get n.

#+begin_src C :includes <stdio.h> <stdint.h>
int get_expo(uint64_t num);

int main() {
    int n = get_expo(8);
    printf("nums %d\n", n);
    return 0;
}

int get_expo(uint64_t num) {
  int n = 0;
  while (num > 1) {
    ++n;
    num >>= 1;
  }
  return n;
}

#+end_src

#+RESULTS:
: nums 3

Then, we bit-shift right the memory size by the exponent.

